; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-11)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city4)
	(fuel-level plane1 fl6)
	(at plane2 city8)
	(fuel-level plane2 fl4)
	(at plane3 city8)
	(fuel-level plane3 fl5)
	(at person1 city9)
	(at person2 city2)
	(at person3 city3)
	(at person4 city11)
	(at person5 city14)
	(at person6 city14)
	(at person7 city0)
	(at person8 city8)
	(at person9 city4)
	(at person10 city6)
	(at person11 city13)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city11)
	(at person2 city15)
	(at person3 city7)
	(at person4 city9)
	(at person5 city10)
	(at person6 city16)
	(at person7 city8)
	(at person8 city8)
	(at person9 city10)
	(at person10 city16)
	(at person11 city7)
	))

)

; plan
1. (fly plane3 city8 city0 fl5 fl4)
   deleted: (at plane3 city8) (fuel-level plane3 fl5)
   added: (at plane3 city0) (fuel-level plane3 fl4)
   goals met: 1 of 11
2. (board person7 plane3 city0)
   deleted: (at person7 city0)
   added: (in person7 plane3)
   goals met: 1 of 11
3. (zoom plane3 city0 city8 fl4 fl3 fl2)
   deleted: (at plane3 city0) (fuel-level plane3 fl4)
   added: (at plane3 city8) (fuel-level plane3 fl2)
   goals met: 1 of 11
4. (debark person7 plane3 city8)
   deleted: (in person7 plane3)
   added: (at person7 city8)
   goals met: 2 of 11
5. (zoom plane1 city4 city14 fl6 fl5 fl4)
   deleted: (at plane1 city4) (fuel-level plane1 fl6)
   added: (at plane1 city14) (fuel-level plane1 fl4)
   goals met: 2 of 11
6. (board person6 plane1 city14)
   deleted: (at person6 city14)
   added: (in person6 plane1)
   goals met: 2 of 11
7. (board person5 plane1 city14)
   deleted: (at person5 city14)
   added: (in person5 plane1)
   goals met: 2 of 11
8. (zoom plane1 city14 city10 fl4 fl3 fl2)
   deleted: (at plane1 city14) (fuel-level plane1 fl4)
   added: (at plane1 city10) (fuel-level plane1 fl2)
   goals met: 2 of 11
9. (debark person5 plane1 city10)
   deleted: (in person5 plane1)
   added: (at person5 city10)
   goals met: 3 of 11
10. (zoom plane1 city10 city16 fl2 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl2)
   added: (at plane1 city16) (fuel-level plane1 fl0)
   goals met: 3 of 11
11. (zoom plane2 city8 city11 fl4 fl3 fl2)
   deleted: (at plane2 city8) (fuel-level plane2 fl4)
   added: (at plane2 city11) (fuel-level plane2 fl2)
   goals met: 3 of 11
12. (board person4 plane2 city11)
   deleted: (at person4 city11)
   added: (in person4 plane2)
   goals met: 3 of 11
13. (zoom plane2 city11 city9 fl2 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl2)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 3 of 11
14. (debark person4 plane2 city9)
   deleted: (in person4 plane2)
   added: (at person4 city9)
   goals met: 4 of 11
15. (board person1 plane2 city9)
   deleted: (at person1 city9)
   added: (in person1 plane2)
   goals met: 4 of 11
16. (refuel plane2 city9 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 4 of 11
17. (debark person6 plane1 city16)
   deleted: (in person6 plane1)
   added: (at person6 city16)
   goals met: 5 of 11
18. (zoom plane3 city8 city13 fl2 fl1 fl0)
   deleted: (at plane3 city8) (fuel-level plane3 fl2)
   added: (at plane3 city13) (fuel-level plane3 fl0)
   goals met: 5 of 11
19. (board person11 plane3 city13)
   deleted: (at person11 city13)
   added: (in person11 plane3)
   goals met: 5 of 11
20. (refuel plane3 city13 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 11
21. (fly plane3 city13 city2 fl1 fl0)
   deleted: (at plane3 city13) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 5 of 11
22. (refuel plane3 city2 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 11
23. (board person2 plane3 city2)
   deleted: (at person2 city2)
   added: (in person2 plane3)
   goals met: 5 of 11
24. (fly plane3 city2 city15 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city15) (fuel-level plane3 fl0)
   goals met: 5 of 11
25. (refuel plane3 city15 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 5 of 11
26. (debark person2 plane3 city15)
   deleted: (in person2 plane3)
   added: (at person2 city15)
   goals met: 6 of 11
27. (fly plane3 city15 city3 fl1 fl0)
   deleted: (at plane3 city15) (fuel-level plane3 fl1)
   added: (at plane3 city3) (fuel-level plane3 fl0)
   goals met: 6 of 11
28. (refuel plane3 city3 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 11
29. (board person3 plane3 city3)
   deleted: (at person3 city3)
   added: (in person3 plane3)
   goals met: 6 of 11
30. (fly plane3 city3 city7 fl1 fl0)
   deleted: (at plane3 city3) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 6 of 11
31. (debark person3 plane3 city7)
   deleted: (in person3 plane3)
   added: (at person3 city7)
   goals met: 7 of 11
32. (debark person11 plane3 city7)
   deleted: (in person11 plane3)
   added: (at person11 city7)
   goals met: 8 of 11
33. (fly plane2 city9 city11 fl1 fl0)
   deleted: (at plane2 city9) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 8 of 11
34. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 11
35. (debark person1 plane2 city11)
   deleted: (in person1 plane2)
   added: (at person1 city11)
   goals met: 9 of 11
36. (fly plane2 city11 city4 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city4) (fuel-level plane2 fl0)
   goals met: 9 of 11
37. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 11
38. (board person9 plane2 city4)
   deleted: (at person9 city4)
   added: (in person9 plane2)
   goals met: 9 of 11
39. (refuel plane2 city4 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 9 of 11
40. (fly plane2 city4 city10 fl1 fl0)
   deleted: (at plane2 city4) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 9 of 11
41. (debark person9 plane2 city10)
   deleted: (in person9 plane2)
   added: (at person9 city10)
   goals met: 10 of 11
42. (fly plane3 city7 city6 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 10 of 11
43. (board person10 plane3 city6)
   deleted: (at person10 city6)
   added: (in person10 plane3)
   goals met: 10 of 11
44. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 10 of 11
45. (fly plane3 city6 city16 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city16) (fuel-level plane3 fl0)
   goals met: 10 of 11
46. (debark person10 plane3 city16)
   deleted: (in person10 plane3)
   added: (at person10 city16)
   goals met: 11 of 11
